{
  "title": "Frequently Asked Questions: Mastering Hotel Pricing Strategies to Boost Your Revenue",
  "url": "https://roompricegenie.com/en_gb/frequently-asked-questions-mastering-hotel-pricing-strategies-to-boost-your-revenue/",
  "description": "In a recent webinar, a panel of industry experts from RoomPriceGenie, answered your questions related to hotel pricing strategies.",
  "content": "Setting the “right” prices for your hotel rooms to attract the right guests and maximize revenue can feel like a quest we could title: “Fantastic Beasts and Where to Find Them.” The work involved in finding the “right prices” brings a lot of headaches to many hoteliers, especially if you’re juggling a few different jobs at the same time: managing the hotel, customer service, housekeeping, and now also revenue management. The simplest advice might be: get a revenue management system—it will find the right price for you. While that’s true, we’re here to equip you with revenue knowledge, because the more you understand, the more confident and in control you’ll feel over your pricing and revenue strategies. (Well, okay, occasionally we’re here to tell you how amazing RoomPriceGenie is!) That’s why in the webinar “Increase revenue with the right pricing strategies: Q&A with experts,” RoomPriceGenie’s revenue management experts answered your most common questions to help you find thefantasticright prices for your hotel rooms. ## Contents 1.How do you set objectives as a hotel owner? 2.What to look at when you want to set your hotel room rates? 3.How do you know you are on the right track with pricing in your property? 4.How to use data and what data to improve your pricing strategy? 5.How frequently should you review your pricing performance? 6.How do you start with dynamic pricing in your hotel? 7.Watch the webinar “Increase revenue with the right pricing strategies” on demand ## How do you set objectives for your property as a hotel owner? In the hospitality industry, setting objectives as a hotel owner involves an analysis of several key metrics: revenue, occupancy, and average daily rate (ADR). First, assess how much money your property is making and fits current occupancy levels. Compare these figures with those from the previous year to identify areas for improvement. Key metrics to focus on includeRevenue per Available Room(RevPAR), which combines occupancy and ADR to give a comprehensive view of performance. RevPAR is crucial as it reflects how well you are using your available inventory. Set specific targets for total revenue, ADR, and RevPAR based on past performance and future goals. This helps ensure you’re not underselling rooms too far in advance or overpricing them at the last minute, which could lead to last-minute price drops to fill rooms. Regularly track these metrics to stay on course and adjust strategies as needed to optimize revenue and occupancy. ## What to look at when you want to set your hotel room rates When setting your rates, there are numerous factors to consider, given the vast amount of data available today. Hendrik Niehues, Sales & Revenue Manager at RoomPriceGenie, shared during the webinar: “We’re living in a world where data is endless and we can take more and more and more data into account. So it all depends on how much time we have. How many tools we use, and it’s not just coming down to a revenue management system, but everything around it.” - First, consider the size and location of your property. Larger properties with more resources might delve deeper into data analysis, while smaller properties might start with basic comparisons. - Assess your competitors and understand their pricing strategies, amenities offered, and their reputation scores on platforms like Booking.com and Google. - Next, evaluate your offerings. For instance, if you offer breakfast but not dinner, you should not compare your rates directly with resorts that provide full meal services and spa facilities. Each amenity adds value and can influence your pricing strategy. - Finally, set realistic goals based on your property’s unique characteristics and objectives. Whether you aim to maximize revenue to the last percentage point or take a more straightforward approach, understanding these variables will help you set competitive and profitable rates. Read “Keep Your Eyes on the Prize: Setting Objectives in Hotel Revenue Management” to learn more about setting revenue management objectives for your property. ## How do you know you are on the right track with pricing in your property? To know if you’re on the right track with your pricing, you need to monitor both your property data and market data. Start by ensuring you have a clear budget and objectives. If your occupancy rates are consistently around 85-90% during high-demand periods, and your lead times are reasonable, you’re likely maximizing revenue effectively. However, if you’re reaching high occupancy too far in advance, it suggests you may have priced too low, missing potential higher revenue. “If for example, let’s say for August, which is three months from now, you are already at 80% occupancy, then even if you are in a destination with a larger booking window, you most likely have sold too cheap, because you still have a long time to get to that month, and you are already almost at full occupancy. The owner might be happy because he sold everything and sometimes owners are happy with that, but he could have made more considering what the market was willing to pay for his property” –explains Sales and Revenue Manager in Spain,Jose Miranda. Additionally, review your value-for-money scores on OTAs or review sites. High scores suggest you could charge more, while low scores might mean you’re overcharging for what you offer. “This helps you determine how your customers perceive your value for money. You don’t want to be way too high, but you don’t want to be too low either. So you want to sit at the right level, especially compared to hotels around you. If your value-for-money score is really high, could this indicate that you have some potential to charge a little bit more? And if your value for money score is really low, then that’s also something I would look at and ask myself: could it be that you’re charging a little bit more than what you have to offer?” –adds Sales & Revenue Manager for APAC,Giulia Orlando. In essence, it’s crucial to constantly monitor booking pace, competitive pricing, and customer value perception. The least time-consuming way is to utilize a system to track pricing fluctuations and your market position.Revenue management systems, like RoomPriceGenie, can significantly ease this process, providing insights that manual tracking might miss. ## How to use data and what data to improve your pricing strategy? Knowledge truly is power, and data provides you with the insights needed to make smarter, faster, and more effective decisions. Here’s how to use data to improve your pricing strategies: 1. Learn from the past Use reports from your property management system (PMS) to analyze historical data. This can help you understand past performance and make informed decisions for the future. For instance, if your booking report reveals a high volume of deeply discounted rates through an OTA channel well in advance, it may indicate that you’re allocating too much inventory to that channel. Adjusting this can help you maximize revenue closer to the booking date. 2. Booking window insights Pay close attention to your booking window. If you notice that deeply discounted rooms are being booked far in advance (e.g., 90 days out) while your typical booking window is only 14 days, it suggests you might be offering discounts prematurely. This insight allows you to pull back and offer discounts more strategically, ensuring you maximize revenue. 3. Put your detective hat on Think of analyzing data as detective work. You need to sleuth out the best price at the right time. This involves understanding whether your customers are corporate or leisure, their booking behaviors, and their price sensitivities. For instance, if you’re struggling to fill rooms closer to the date, you might need to adjust prices or offer discounts. 4. Key reports Use key reports and indicators from your PMS to track crucial metrics. These might include occupancy rates, average daily rates, and revenue per available room (RevPAR). Accurate reports can help you pivot your strategies quickly. For example, if you see high occupancy but low RevPAR, it might be time to increase rates or adjust your marketing strategies. 5. Ensure you collect the right data “Make sure that your data is accurate because many times – I don’t know about your cases, but in my case – when working directly in the hotel operations, we had to check the reports and fix them because we were collecting wrong data. So train the whole staff to make sure they are properly filling in all of the fields in the PMS so you can get good data to trust,”says Sales and Revenue Manager for North America,Leslie Hoy. 6. Compare your property’s performance with market data. This helps you understand if you’re on the right track. For example, if your value-for-money scores on OTA sites are significantly higher than your competitors, it might indicate you have room to increase prices. Conversely, if your scores are lower, you may need to enhance your offerings or adjust prices. ## How frequently should you review your pricing performance? Should you check it all the time or maybe once a week? Determining the frequency of pricing performance reviews is crucial and varies depending on several factors, such as the size and type of property and the tools available for managing prices. For large properties, like a 400-room hotel near an airport, frequent price checks are essential due to the high volume of bookings and the competitive nature of the market. In contrast, smaller, family-run hotels with fewer rooms might find that less frequent reviews suffice. For properties equipped with a revenue management system, even smaller establishments with 10 to 30 rooms can efficiently manage pricing by conducting strategic reviews a few times a month. In regions like APAC, it is recommended to review pricing strategies at the beginning and end of each month to ensure alignment with market conditions and to identify any necessary adjustments. Ultimately, the goal is to strike a balance that suits the property’s specific needs, enabling you to optimize your pricing strategy while dedicating more time to improving guest experiences and overall operational efficiency. ## How do you start with dynamic pricing in your hotel? When you are new todynamic pricing, transitioning from manual methods to a more flexible pricing model can seem scary. The initial fear and overwhelm are understandable, given the abundance of information and various tools available. However, at its core, dynamic pricing revolves around the basic economic principles of supply and demand. Embracing this approach with an open mind can lead to significant benefits. “I would say don’t be afraid to push your limits a little bit in terms of increasing or decreasing your rates. Testing those limits can really help you understand and learn where you can really drive rates and capitalize during your high demand periods or when you might want to draw pricing and take more occupancy based pricing.”–Hannah Lee, Sales & Country Manager North America at RPG. Approach dynamic pricing with flexibility and a willingness to adapt, as these qualities will be crucial in leveraging this strategy effectively for your property. As for your guests, most travelers are already used to the price changes – either from big hotel chains or airlines. In fact,the study that we did with ZHAW School of Management and Law on the effect of dynamic pricingin hotels showed no significant change in overall guest satisfaction, perceived price fairness and intention to recommend the hotel. The unpredictability of the hospitality market requires regular price and market monitoring to stay competitive. Dynamic pricing, which adjusts rates based on demand, is increasingly being adopted to cope with these fluctuations. However, without automated tools, the process of manually checking prices can become overwhelming and still fall short.Implementing a reliable pricing tool can significantly reduce the manual workload, automating daily price adjustments and allowing you to focus on strategic tasks such as enhancing guest services and training staff. ## Watch the webinar “Increase revenue with the right pricing strategies” on demand All of the above is just a small portion of what we have discussed during the webinar “Q&A with experts: increase revenue with the right pricing strategies”. You can watch the full webinar to get answers to questions like: - What are the core responsibilities of a Revenue Manager - Does the RMS make sense for smaller properties - What things should you consider when evaluating RMS solutions - What are the differences in theory and execution between pricing for traditional hotel rooms versus a standalone Airbnb - New hotel versus established property: should pricing strategies be different for the new hotel versus the established one? And so much more. Watch the webinar “Increase revenue with the right hotel pricing strategies” – Europe Watch the webinar “Increase revenue with the right hotel pricing strategies” – APAC / NA ## Contents 1.How do you set objectives as a hotel owner? 2.What to look at when you want to set your hotel room rates? 3.How do you know you are on the right track with pricing in your property? 4.How to use data and what data to improve your pricing strategy? 5.How frequently should you review your pricing performance? 6.How do you start with dynamic pricing in your hotel? 7.Watch the webinar “Increase revenue with the right pricing strategies” on demand To learn how RoomPriceGenie can help your property increase your property’s profitability,start your free trialof our automated pricing solution today!",
  "category": "articles",
  "chunks": [
    "Setting the “right” prices for your hotel rooms to attract the right guests and maximize revenue can feel like a quest we could title: “Fantastic Beasts and Where to Find Them.” The work involved in finding the “right prices” brings a lot of headaches to many hoteliers, especially if you’re juggling a few different jobs at the same time: managing the hotel, customer service, housekeeping, and now also revenue management. The simplest advice might be: get a revenue management system—it will find the right price for you. While that’s true, we’re here to equip you with revenue knowledge, because the more you understand, the more confident and in control you’ll feel over your pricing and revenue strategies. (Well, okay, occasionally we’re here to tell you how amazing RoomPriceGenie is!) That’s why in the webinar “Increase revenue with the right pricing strategies: Q&A with experts,” RoomPriceGenie’s revenue management experts answered your most common questions to help you find thefantasticright prices for your hotel rooms. ## Contents 1.How do you set objectives as a hotel owner? 2.What to look at when you want to set your hotel room rates? 3.How do you know you are on the right track with pricing in your property? 4.How to use data and what data to improve your pricing strategy? 5.How frequently should you review your pricing performance? 6.How do you start with dynamic pricing in your hotel? 7.Watch the webinar “Increase revenue with the right pricing strategies” on demand ## How do you set objectives for your property as a hotel owner? In the hospitality industry, setting objectives as a hotel owner involves an analysis of several key metrics: revenue, occupancy, and average daily rate (ADR). First, assess how much money your property is making and fits current occupancy levels. Compare these figures with those from the previous year to identify areas for improvement. Key metrics to focus on includeRevenue per Available Room(RevPAR), which combines occupancy and ADR to give a comprehensive view of performance. RevPAR is crucial as it reflects how well you are using your available inventory. Set specific targets for total revenue, ADR, and RevPAR based on past performance and future goals. This helps ensure you’re not underselling rooms too far in advance or overpricing them at the last minute, which could lead to last-minute price drops to fill rooms. Regularly track these metrics to stay on course and adjust strategies as needed to optimize revenue and occupancy. ## What to look at when you want to set your hotel room rates When setting your rates, there are numerous factors to consider, given the vast amount of data available today. Hendrik Niehues, Sales & Revenue Manager at RoomPriceGenie, shared during the webinar: “We’re living in a world where data is endless and we can take more and more and more data into account. So it all depends on how much time we have. How many tools we use, and it’s not just coming down to a revenue management system, but everything around",
    "“We’re living in a world where data is endless and we can take more and more and more data into account. So it all depends on how much time we have. How many tools we use, and it’s not just coming down to a revenue management system, but everything around it.” - First, consider the size and location of your property. Larger properties with more resources might delve deeper into data analysis, while smaller properties might start with basic comparisons. - Assess your competitors and understand their pricing strategies, amenities offered, and their reputation scores on platforms like Booking.com and Google. - Next, evaluate your offerings. For instance, if you offer breakfast but not dinner, you should not compare your rates directly with resorts that provide full meal services and spa facilities. Each amenity adds value and can influence your pricing strategy. - Finally, set realistic goals based on your property’s unique characteristics and objectives. Whether you aim to maximize revenue to the last percentage point or take a more straightforward approach, understanding these variables will help you set competitive and profitable rates. Read “Keep Your Eyes on the Prize: Setting Objectives in Hotel Revenue Management” to learn more about setting revenue management objectives for your property. ## How do you know you are on the right track with pricing in your property? To know if you’re on the right track with your pricing, you need to monitor both your property data and market data. Start by ensuring you have a clear budget and objectives. If your occupancy rates are consistently around 85-90% during high-demand periods, and your lead times are reasonable, you’re likely maximizing revenue effectively. However, if you’re reaching high occupancy too far in advance, it suggests you may have priced too low, missing potential higher revenue. “If for example, let’s say for August, which is three months from now, you are already at 80% occupancy, then even if you are in a destination with a larger booking window, you most likely have sold too cheap, because you still have a long time to get to that month, and you are already almost at full occupancy. The owner might be happy because he sold everything and sometimes owners are happy with that, but he could have made more considering what the market was willing to pay for his property” –explains Sales and Revenue Manager in Spain,Jose Miranda. Additionally, review your value-for-money scores on OTAs or review sites. High scores suggest you could charge more, while low scores might mean you’re overcharging for what you offer. “This helps you determine how your customers perceive your value for money. You don’t want to be way too high, but you don’t want to be too low either. So you want to sit at the right level, especially compared to hotels around you. If your value-for-money score is really high, could this indicate that you have some potential to charge a little bit more? And if your value for money score is",
    "want to be too low either. So you want to sit at the right level, especially compared to hotels around you. If your value-for-money score is really high, could this indicate that you have some potential to charge a little bit more? And if your value for money score is really low, then that’s also something I would look at and ask myself: could it be that you’re charging a little bit more than what you have to offer?” –adds Sales & Revenue Manager for APAC,Giulia Orlando. In essence, it’s crucial to constantly monitor booking pace, competitive pricing, and customer value perception. The least time-consuming way is to utilize a system to track pricing fluctuations and your market position.Revenue management systems, like RoomPriceGenie, can significantly ease this process, providing insights that manual tracking might miss. ## How to use data and what data to improve your pricing strategy? Knowledge truly is power, and data provides you with the insights needed to make smarter, faster, and more effective decisions. Here’s how to use data to improve your pricing strategies: 1. Learn from the past Use reports from your property management system (PMS) to analyze historical data. This can help you understand past performance and make informed decisions for the future. For instance, if your booking report reveals a high volume of deeply discounted rates through an OTA channel well in advance, it may indicate that you’re allocating too much inventory to that channel. Adjusting this can help you maximize revenue closer to the booking date. 2. Booking window insights Pay close attention to your booking window. If you notice that deeply discounted rooms are being booked far in advance (e.g., 90 days out) while your typical booking window is only 14 days, it suggests you might be offering discounts prematurely. This insight allows you to pull back and offer discounts more strategically, ensuring you maximize revenue. 3. Put your detective hat on Think of analyzing data as detective work. You need to sleuth out the best price at the right time. This involves understanding whether your customers are corporate or leisure, their booking behaviors, and their price sensitivities. For instance, if you’re struggling to fill rooms closer to the date, you might need to adjust prices or offer discounts. 4. Key reports Use key reports and indicators from your PMS to track crucial metrics. These might include occupancy rates, average daily rates, and revenue per available room (RevPAR). Accurate reports can help you pivot your strategies quickly. For example, if you see high occupancy but low RevPAR, it might be time to increase rates or adjust your marketing strategies. 5. Ensure you collect the right data “Make sure that your data is accurate because many times – I don’t know about your cases, but in my case – when working directly in the hotel operations, we had to check the reports and fix them because we were collecting wrong data. So train the whole staff to make sure they are properly",
    "is accurate because many times – I don’t know about your cases, but in my case – when working directly in the hotel operations, we had to check the reports and fix them because we were collecting wrong data. So train the whole staff to make sure they are properly filling in all of the fields in the PMS so you can get good data to trust,”says Sales and Revenue Manager for North America,Leslie Hoy. 6. Compare your property’s performance with market data. This helps you understand if you’re on the right track. For example, if your value-for-money scores on OTA sites are significantly higher than your competitors, it might indicate you have room to increase prices. Conversely, if your scores are lower, you may need to enhance your offerings or adjust prices. ## How frequently should you review your pricing performance? Should you check it all the time or maybe once a week? Determining the frequency of pricing performance reviews is crucial and varies depending on several factors, such as the size and type of property and the tools available for managing prices. For large properties, like a 400-room hotel near an airport, frequent price checks are essential due to the high volume of bookings and the competitive nature of the market. In contrast, smaller, family-run hotels with fewer rooms might find that less frequent reviews suffice. For properties equipped with a revenue management system, even smaller establishments with 10 to 30 rooms can efficiently manage pricing by conducting strategic reviews a few times a month. In regions like APAC, it is recommended to review pricing strategies at the beginning and end of each month to ensure alignment with market conditions and to identify any necessary adjustments. Ultimately, the goal is to strike a balance that suits the property’s specific needs, enabling you to optimize your pricing strategy while dedicating more time to improving guest experiences and overall operational efficiency. ## How do you start with dynamic pricing in your hotel? When you are new todynamic pricing, transitioning from manual methods to a more flexible pricing model can seem scary. The initial fear and overwhelm are understandable, given the abundance of information and various tools available. However, at its core, dynamic pricing revolves around the basic economic principles of supply and demand. Embracing this approach with an open mind can lead to significant benefits. “I would say don’t be afraid to push your limits a little bit in terms of increasing or decreasing your rates. Testing those limits can really help you understand and learn where you can really drive rates and capitalize during your high demand periods or when you might want to draw pricing and take more occupancy based pricing.”–Hannah Lee, Sales & Country Manager North America at RPG. Approach dynamic pricing with flexibility and a willingness to adapt, as these qualities will be crucial in leveraging this strategy effectively for your property. As for your guests, most travelers are already used to the price changes –",
    "occupancy based pricing.”–Hannah Lee, Sales & Country Manager North America at RPG. Approach dynamic pricing with flexibility and a willingness to adapt, as these qualities will be crucial in leveraging this strategy effectively for your property. As for your guests, most travelers are already used to the price changes – either from big hotel chains or airlines. In fact,the study that we did with ZHAW School of Management and Law on the effect of dynamic pricingin hotels showed no significant change in overall guest satisfaction, perceived price fairness and intention to recommend the hotel. The unpredictability of the hospitality market requires regular price and market monitoring to stay competitive. Dynamic pricing, which adjusts rates based on demand, is increasingly being adopted to cope with these fluctuations. However, without automated tools, the process of manually checking prices can become overwhelming and still fall short.Implementing a reliable pricing tool can significantly reduce the manual workload, automating daily price adjustments and allowing you to focus on strategic tasks such as enhancing guest services and training staff. ## Watch the webinar “Increase revenue with the right pricing strategies” on demand All of the above is just a small portion of what we have discussed during the webinar “Q&A with experts: increase revenue with the right pricing strategies”. You can watch the full webinar to get answers to questions like: - What are the core responsibilities of a Revenue Manager - Does the RMS make sense for smaller properties - What things should you consider when evaluating RMS solutions - What are the differences in theory and execution between pricing for traditional hotel rooms versus a standalone Airbnb - New hotel versus established property: should pricing strategies be different for the new hotel versus the established one? And so much more. Watch the webinar “Increase revenue with the right hotel pricing strategies” – Europe Watch the webinar “Increase revenue with the right hotel pricing strategies” – APAC / NA ## Contents 1.How do you set objectives as a hotel owner? 2.What to look at when you want to set your hotel room rates? 3.How do you know you are on the right track with pricing in your property? 4.How to use data and what data to improve your pricing strategy? 5.How frequently should you review your pricing performance? 6.How do you start with dynamic pricing in your hotel? 7.Watch the webinar “Increase revenue with the right pricing strategies” on demand To learn how RoomPriceGenie can help your property increase your property’s profitability,start your free trialof our automated pricing solution today!"
  ]
}