{
  "title": "How to Convince Your General Manager to Say Yes to an RMS",
  "url": "https://roompricegenie.com/en_gb/how-to-convince-your-general-manager-to-say-yes-to-an-rms/",
  "description": "So, how do you convince your general manager to say yes to an RMS? Follow these four steps to make a successful pitch.",
  "content": "You know your property can’t continue to operate efficiently without arevenue management system (RMS)to automate forecasting, market monitoring, and dynamic pricing. The payoff? Higher occupancy, higher rates, and more time for strategy. So, how do you convince your general manager to say yes? Follow these four steps to make a successful pitch. ## 1.Recognize the Hidden Costs of Not Using an RMS First, put yourself in the GM’s shoes. They juggle numerous priorities, and an RMS might not seem as urgent to them as it does to you. The most common hesitation comes down to cost. But the real question is: what’s the cost ofnotusing an RMS? Without one, hotels often: - Lose revenue by mispricing rooms relative to demand. - Spend excessive time manually adjusting rates instead of focusing on strategy. - Struggle with forecasting, which results in poor planning and missed revenue. - React too slowly to market changes, giving competitors an advantage. ## 2.Build a Business Case for an RMS To win over your GM, speak their language. Frame the RMS as an investment in efficiency and profitability—not just another tech expense. Here’s how an RMS delivers: - Increases revenue– Data-driven pricing ensures you capture the best possible rate for every booking. - Saves time– Automation reduces the need for manual rate adjustments, freeing up time for strategic initiatives. - Improves forecasting– More accurate demand predictions lead to smarter pricing and inventory decisions. As Leon Pijpers, Chief Commercial Officer at RoomPriceGenie, explains: “As a revenue manager, your role as a champion for RMS investment is to build a strong business case that aligns with your General Manager’s priorities—profitability, efficiency, and staying competitive. We understand that investment decisions require proof, which is why we provide real-world success stories from similar hotels, showcasing how they’ve streamlined operations and optimized pricing. Independent reviews on HTR reinforce the trust that hoteliers place in RoomPriceGenie. Most importantly, we don’t just offer automation—we provide expert support from experienced revenue managers to help you maximize results and make data-driven decisions with confidence.” ## 3.Address Common GM Objections GMs can be predictable—especially when it comes to budget approvals. Other times, they throw curveballs. Anticipating a range of possible objections allows you to respond with confidence in any scenario. Objection 1: “We can’t afford it.” If an RMS wasn’t budgeted, your GM may be reluctant to reallocate funds. - Demonstrate the cost of manual pricing inefficiencies. How much money is slipping through the cracks? - Highlight the return on investment (ROI). A good RMS delivers immediate returns, and some hotels see a full payback within months. Objection 2: “We don’t need it.” If manual pricing has worked in the past, why change now? - Explain why gut-feel pricing no longer suffices in today’s data-driven market. - Highlight how pricing goes unchecked on evenings and weekends, resulting in lost revenue. - Share examples of how revenue technology has contributed to the success of your competitors. Objection 3: “I don’t want to lose control.” Automation can feel like a risk, especially when it comes to pricing. - Clarify that an RMS provides recommendations, but the final decision always rests with the team. - Highlight the flexibility of customizable settings, including rate floors and ceilings, custom rules, manual overrides, and autopilot options. - Explain how automation enhances control by reducing errors and ensuring consistent pricing. Objection 4: “We have a revenue manager for that.” If your hotel has a revenue manager, the GM may assume an RMS isn’t necessary. - Outline time-consuming manual tasks that could be automated. - Show what’s being neglected due to manual work, such as strategic revenue planning and collaboration with sales and marketing. - Explain that an RMS amplifies a revenue manager’s impact—it doesn’t replace them. Together, they makea powerful team. Objection 5: “We don’t have a revenue manager.” If there’s no revenue expert on staff, the GM may think an RMS is too complicated to manage. - Emphasize ease of use—modern RMS platforms are designed for non-experts. - Show that a well-designed RMS requires only a few hours per week to manage. - Explain how the RMS syncs with your channel manager to update rates and availability across all distribution channels automatically. ## 4.Assemble Tools to Support a Winning Pitch Leverage these tools to support your case: - Show the data. Use real numbers to show potential revenue gains and time savings. For example, a study found that small hotels earned an average of$70,000 per year in incremental revenueafter implementing an RMS. - Share a case study.Highlight a concrete example, such as how three Madrid propertiesincreased revenue by 108%during Taylor Swift concerts using an RMS. - Recommend the best fit. Research options and present the ideal RMS for your property or group, including key features and pricing. For guidance, check out10 Steps to Choosing the Right RMS for Your Hotel. - Demonstrate the ROI.Use RoomPriceGenie’sROI Calculatorto show how quickly the system will pay for itself. - Offer a quick demo. Arrange alive demoso your GM can experience the system firsthand. - Involve key stakeholders.Bring in managers from key departments, such as sales and marketing, finance, or the rooms division, to reinforce the business case. Compile these items into a concise presentation and leave materials with the GM for review. ## Now You’re Ready to Make the Ask An RMS does more than set prices—it sets your hotel up for long-term success. When you present it as a strategic business decision rather than just another tech upgrade, your GM will see it as a competitive advantage they can’t afford to miss. And once it’s in place, they’ll wonder how they ever managed without it. Start building your case today with RoomPriceGenie’sROI Calculator. Simply input details about your property, and we’ll calculate your revenue potential and time savings. To learn how RoomPriceGenie can help your property increase your property’s profitability,start your free trialof our automated pricing solution today!",
  "category": "articles",
  "chunks": [
    "You know your property can’t continue to operate efficiently without arevenue management system (RMS)to automate forecasting, market monitoring, and dynamic pricing. The payoff? Higher occupancy, higher rates, and more time for strategy. So, how do you convince your general manager to say yes? Follow these four steps to make a successful pitch. ## 1.Recognize the Hidden Costs of Not Using an RMS First, put yourself in the GM’s shoes. They juggle numerous priorities, and an RMS might not seem as urgent to them as it does to you. The most common hesitation comes down to cost. But the real question is: what’s the cost ofnotusing an RMS? Without one, hotels often: - Lose revenue by mispricing rooms relative to demand. - Spend excessive time manually adjusting rates instead of focusing on strategy. - Struggle with forecasting, which results in poor planning and missed revenue. - React too slowly to market changes, giving competitors an advantage. ## 2.Build a Business Case for an RMS To win over your GM, speak their language. Frame the RMS as an investment in efficiency and profitability—not just another tech expense. Here’s how an RMS delivers: - Increases revenue– Data-driven pricing ensures you capture the best possible rate for every booking. - Saves time– Automation reduces the need for manual rate adjustments, freeing up time for strategic initiatives. - Improves forecasting– More accurate demand predictions lead to smarter pricing and inventory decisions. As Leon Pijpers, Chief Commercial Officer at RoomPriceGenie, explains: “As a revenue manager, your role as a champion for RMS investment is to build a strong business case that aligns with your General Manager’s priorities—profitability, efficiency, and staying competitive. We understand that investment decisions require proof, which is why we provide real-world success stories from similar hotels, showcasing how they’ve streamlined operations and optimized pricing. Independent reviews on HTR reinforce the trust that hoteliers place in RoomPriceGenie. Most importantly, we don’t just offer automation—we provide expert support from experienced revenue managers to help you maximize results and make data-driven decisions with confidence.” ## 3.Address Common GM Objections GMs can be predictable—especially when it comes to budget approvals. Other times, they throw curveballs. Anticipating a range of possible objections allows you to respond with confidence in any scenario. Objection 1: “We can’t afford it.” If an RMS wasn’t budgeted, your GM may be reluctant to reallocate funds. - Demonstrate the cost of manual pricing inefficiencies. How much money is slipping through the cracks? - Highlight the return on investment (ROI). A good RMS delivers immediate returns, and some hotels see a full payback within months. Objection 2: “We don’t need it.” If manual pricing has worked in the past, why change now? - Explain why gut-feel pricing no longer suffices in today’s data-driven market. - Highlight how pricing goes unchecked on evenings and weekends, resulting in lost revenue. - Share examples of how revenue technology has contributed to the success of your competitors. Objection 3: “I don’t want to lose control.” Automation can feel like",
    "gut-feel pricing no longer suffices in today’s data-driven market. - Highlight how pricing goes unchecked on evenings and weekends, resulting in lost revenue. - Share examples of how revenue technology has contributed to the success of your competitors. Objection 3: “I don’t want to lose control.” Automation can feel like a risk, especially when it comes to pricing. - Clarify that an RMS provides recommendations, but the final decision always rests with the team. - Highlight the flexibility of customizable settings, including rate floors and ceilings, custom rules, manual overrides, and autopilot options. - Explain how automation enhances control by reducing errors and ensuring consistent pricing. Objection 4: “We have a revenue manager for that.” If your hotel has a revenue manager, the GM may assume an RMS isn’t necessary. - Outline time-consuming manual tasks that could be automated. - Show what’s being neglected due to manual work, such as strategic revenue planning and collaboration with sales and marketing. - Explain that an RMS amplifies a revenue manager’s impact—it doesn’t replace them. Together, they makea powerful team. Objection 5: “We don’t have a revenue manager.” If there’s no revenue expert on staff, the GM may think an RMS is too complicated to manage. - Emphasize ease of use—modern RMS platforms are designed for non-experts. - Show that a well-designed RMS requires only a few hours per week to manage. - Explain how the RMS syncs with your channel manager to update rates and availability across all distribution channels automatically. ## 4.Assemble Tools to Support a Winning Pitch Leverage these tools to support your case: - Show the data. Use real numbers to show potential revenue gains and time savings. For example, a study found that small hotels earned an average of$70,000 per year in incremental revenueafter implementing an RMS. - Share a case study.Highlight a concrete example, such as how three Madrid propertiesincreased revenue by 108%during Taylor Swift concerts using an RMS. - Recommend the best fit. Research options and present the ideal RMS for your property or group, including key features and pricing. For guidance, check out10 Steps to Choosing the Right RMS for Your Hotel. - Demonstrate the ROI.Use RoomPriceGenie’sROI Calculatorto show how quickly the system will pay for itself. - Offer a quick demo. Arrange alive demoso your GM can experience the system firsthand. - Involve key stakeholders.Bring in managers from key departments, such as sales and marketing, finance, or the rooms division, to reinforce the business case. Compile these items into a concise presentation and leave materials with the GM for review. ## Now You’re Ready to Make the Ask An RMS does more than set prices—it sets your hotel up for long-term success. When you present it as a strategic business decision rather than just another tech upgrade, your GM will see it as a competitive advantage they can’t afford to miss. And once it’s in place, they’ll wonder how they ever managed without it. Start building your case today with RoomPriceGenie’sROI Calculator. Simply input",
    "present it as a strategic business decision rather than just another tech upgrade, your GM will see it as a competitive advantage they can’t afford to miss. And once it’s in place, they’ll wonder how they ever managed without it. Start building your case today with RoomPriceGenie’sROI Calculator. Simply input details about your property, and we’ll calculate your revenue potential and time savings. To learn how RoomPriceGenie can help your property increase your property’s profitability,start your free trialof our automated pricing solution today!"
  ]
}