{
  "title": "Taylor Swift Case Study: How Madrid Hotels Leveraged RoomPriceGenie During High-Demand Period",
  "url": "https://roompricegenie.com/en_gb/taylor-swift-case-study-how-madrid-hotels-leveraged-roompricegenie-during-high-demand-period/",
  "description": "Here's how three properties in Madrid leveraged an automated revenue management solution to boost their revenue by an average of 108%.",
  "content": "Imagine this scenario: Taylor Swift posts a new photo on Instagram with a hidden message about her next concert dates and locations, which turns out to be near your property. Whether you’re busy with guests or enjoying time with your family, you might miss this critical information. By the next day, you find your property fully booked for those dates, unaware of the Taylor Swift concert that drove the demand. In case you’re not into Taylor Swift, this American songwriter and singer is famous for hiding “Easter eggs”—hidden messages for her fans. These clues often reveal the themes of her new albums or the dates and locations of her upcoming tours. Her fans, known as Swifties, are always on the lookout for these signs. Without an automated revenue management system, you might miss out on maximizing your revenue during such high-demand events. ## The Challenge The above scenario might sound hypothetical, but similar stories have already happened to many hoteliers worldwide. Hoteliers who come to us often face the challenge of manually tracking market trends, competitor rates, and fluctuating demand. This can lead to missed opportunities, especially during high-demand events like concerts, or industry-specific conferences. The moment they realize what is happening, it’s already too late to adjust their prices because they are already sold out. ## The Solution At RoomPriceGenie, we are determined that this should never happen again to hotels. So, we created a protection model that triggers immediately after a surge of bookings and gives you time to react to the situation. Never again will you sell your rooms too cheap. It ensures hoteliers can capitalize on high-demand periods without needing constant manual monitoring. Read all about Surge Protection here → ## The Results: Here’s how three of our customers in Madrid increased their revenue by 108% on average during the Taylor Swift concerts with the help of RoomPriceGenie, working on autopilot. First of all, it’s important to mention that these three properties had RoomPriceGenie autopilot switched on. This means they did not have to do anything with their pricing if they didn’t want to. Our solution isalwaysworking quietly in the background, optimizing their prices and occupancy. Secondly, all three clients are on our Professional subscription plan, with 24-times-a-day automated price uploads to the PMS and 18 months in advance future price recommendations. Lastly, the dates we compared are May 28 to June 2. Here are their results: ## 160-Room Apartments & Short Stay: In just five days, they covered the costs of RoomPriceGenie for the next nine months. - An average increase of 78% in revenue compared with the same dates in 2023. - May’s ADR increased from 69€ in 2023 to 175€ in 2024 – a 153.62% increase in ADR! - After paying 824€/month to use our software, the average increase in revenue for these dates was a huge 7504€. That’s right you could say in five days, they covered the costs of RoomPriceGenie for the next nine months. ## 92-bed hostel: 120% increase in revenue - This hostel saw an average increase of 120% in revenue compared with the same dates in 2023. - May’s ADR increased from 33€ in 2023 to 92€ in 2024, which means a 178.79% increase! - After paying 202€/month to use our software, the average increase in revenue for these dates was 2141€. The next ten months of the RoomPriceGenie subscription are covered 🙂 ## 50-bed hostel: a 286.36% increase in May’s ADR, compared with May 2023. - An average increase of 127% in revenue compared with the same dates in 2023. - Its May’s ADR increased from 22€ in 2023 to 85€ in 2024, which means a 286.36% increase! - After paying just 202€/month to use our software, the average increase in revenue for these dates was 1252€ compared with the same dates the previous year. You may argue that Taylor Swift had a major impact on these results. And you’re right – but with RoomPriceGenie on autopilot, these hoteliers didn’t have to worry about their pricing and how their results could be affected by no-shows or last-minute cancellations. RoomPriceGenie optimized their pricing in real-time, ensuring maximum revenue and occupancy. ## Say goodbye to missed revenue opportunities during sudden increases in demand And it’s not only Taylor Swift. One of the saddest ways a hotel loses money is when a big event gets announced, and before you know what is happening, you sell your rooms at a fraction of the price you could have charged. We hear from hoteliers and property owners over and over how they were missing out on important dates and events: “I spent hours figuring out how to price my rooms but still missed out on revenue opportunities selling my rooms too cheaply when there was peak demand.” Hector Sarmiento,Oasis Hotel “With the number of properties we manage, you can imagine the time it took to change rates manually. In fact, we needed full-time staff to help manage the pricing. We would often miss the odd holiday or event coming up and therefore leave out on revenue” Greg Marshall,Book Tekapo ## How does theSurge Protectionfeature work? The Surge Protection feature monitors your property’s reservation data to identify when there is a significant increase in bookings for any given day, immediately adjusting the price and alerting you about the increased demand in your destination. The Surge Protection functionality triggers RoomPriceGenie to send you an email alerting you of the surge in demand, with a link that will take you directly to the surge alert in the RoomPriceGenie system, where you can adjust your pricing accordingly. Notifications allow you to change your pricing accordingly to boost revenue, and with real-time automation adjusting your prices, you avoid leaving money on the table. ## Try RoomPriceGenie on your property with a 14-day free trial Ready to maximize your revenue?Meet with our revenue management expertto get started with RoomPriceGenie today. To learn how RoomPriceGenie can help your property increase your property’s profitability,start your free trialof our automated pricing solution today!",
  "category": "articles",
  "chunks": [
    "Imagine this scenario: Taylor Swift posts a new photo on Instagram with a hidden message about her next concert dates and locations, which turns out to be near your property. Whether you’re busy with guests or enjoying time with your family, you might miss this critical information. By the next day, you find your property fully booked for those dates, unaware of the Taylor Swift concert that drove the demand. In case you’re not into Taylor Swift, this American songwriter and singer is famous for hiding “Easter eggs”—hidden messages for her fans. These clues often reveal the themes of her new albums or the dates and locations of her upcoming tours. Her fans, known as Swifties, are always on the lookout for these signs. Without an automated revenue management system, you might miss out on maximizing your revenue during such high-demand events. ## The Challenge The above scenario might sound hypothetical, but similar stories have already happened to many hoteliers worldwide. Hoteliers who come to us often face the challenge of manually tracking market trends, competitor rates, and fluctuating demand. This can lead to missed opportunities, especially during high-demand events like concerts, or industry-specific conferences. The moment they realize what is happening, it’s already too late to adjust their prices because they are already sold out. ## The Solution At RoomPriceGenie, we are determined that this should never happen again to hotels. So, we created a protection model that triggers immediately after a surge of bookings and gives you time to react to the situation. Never again will you sell your rooms too cheap. It ensures hoteliers can capitalize on high-demand periods without needing constant manual monitoring. Read all about Surge Protection here → ## The Results: Here’s how three of our customers in Madrid increased their revenue by 108% on average during the Taylor Swift concerts with the help of RoomPriceGenie, working on autopilot. First of all, it’s important to mention that these three properties had RoomPriceGenie autopilot switched on. This means they did not have to do anything with their pricing if they didn’t want to. Our solution isalwaysworking quietly in the background, optimizing their prices and occupancy. Secondly, all three clients are on our Professional subscription plan, with 24-times-a-day automated price uploads to the PMS and 18 months in advance future price recommendations. Lastly, the dates we compared are May 28 to June 2. Here are their results: ## 160-Room Apartments & Short Stay: In just five days, they covered the costs of RoomPriceGenie for the next nine months. - An average increase of 78% in revenue compared with the same dates in 2023. - May’s ADR increased from 69€ in 2023 to 175€ in 2024 – a 153.62% increase in ADR! - After paying 824€/month to use our software, the average increase in revenue for these dates was a huge 7504€. That’s right you could say in five days, they covered the costs of RoomPriceGenie for the next nine months. ## 92-bed hostel: 120% increase in",
    "a 153.62% increase in ADR! - After paying 824€/month to use our software, the average increase in revenue for these dates was a huge 7504€. That’s right you could say in five days, they covered the costs of RoomPriceGenie for the next nine months. ## 92-bed hostel: 120% increase in revenue - This hostel saw an average increase of 120% in revenue compared with the same dates in 2023. - May’s ADR increased from 33€ in 2023 to 92€ in 2024, which means a 178.79% increase! - After paying 202€/month to use our software, the average increase in revenue for these dates was 2141€. The next ten months of the RoomPriceGenie subscription are covered 🙂 ## 50-bed hostel: a 286.36% increase in May’s ADR, compared with May 2023. - An average increase of 127% in revenue compared with the same dates in 2023. - Its May’s ADR increased from 22€ in 2023 to 85€ in 2024, which means a 286.36% increase! - After paying just 202€/month to use our software, the average increase in revenue for these dates was 1252€ compared with the same dates the previous year. You may argue that Taylor Swift had a major impact on these results. And you’re right – but with RoomPriceGenie on autopilot, these hoteliers didn’t have to worry about their pricing and how their results could be affected by no-shows or last-minute cancellations. RoomPriceGenie optimized their pricing in real-time, ensuring maximum revenue and occupancy. ## Say goodbye to missed revenue opportunities during sudden increases in demand And it’s not only Taylor Swift. One of the saddest ways a hotel loses money is when a big event gets announced, and before you know what is happening, you sell your rooms at a fraction of the price you could have charged. We hear from hoteliers and property owners over and over how they were missing out on important dates and events: “I spent hours figuring out how to price my rooms but still missed out on revenue opportunities selling my rooms too cheaply when there was peak demand.” Hector Sarmiento,Oasis Hotel “With the number of properties we manage, you can imagine the time it took to change rates manually. In fact, we needed full-time staff to help manage the pricing. We would often miss the odd holiday or event coming up and therefore leave out on revenue” Greg Marshall,Book Tekapo ## How does theSurge Protectionfeature work? The Surge Protection feature monitors your property’s reservation data to identify when there is a significant increase in bookings for any given day, immediately adjusting the price and alerting you about the increased demand in your destination. The Surge Protection functionality triggers RoomPriceGenie to send you an email alerting you of the surge in demand, with a link that will take you directly to the surge alert in the RoomPriceGenie system, where you can adjust your pricing accordingly. Notifications allow you to change your pricing accordingly to boost revenue, and with real-time automation adjusting your prices, you avoid",
    "alerting you of the surge in demand, with a link that will take you directly to the surge alert in the RoomPriceGenie system, where you can adjust your pricing accordingly. Notifications allow you to change your pricing accordingly to boost revenue, and with real-time automation adjusting your prices, you avoid leaving money on the table. ## Try RoomPriceGenie on your property with a 14-day free trial Ready to maximize your revenue?Meet with our revenue management expertto get started with RoomPriceGenie today. To learn how RoomPriceGenie can help your property increase your property’s profitability,start your free trialof our automated pricing solution today!"
  ]
}