{
  "title": "The Oak Tree Inn",
  "url": "https://roompricegenie.com/en_gb/case-studies/the-oak-tree-inn/",
  "description": "How The Oak Tree Inn has improved its processes and increased occupancy by 8% and revenue by 10% through working with Rezcontrol PMS and RoomPriceGenie.",
  "content": "## The Oak Tree Inn - Scotland - 26 to 50 rooms - Rezcontrol The Oak Tree Innis a charming, family-run hotel with 42 bedrooms on the banks of Loch Lomond in the picturesque village of Balmaha. They upgraded from Avondata’s previous server-based PMS, Hotel Executive, to move to the cloud with Rezcontrol just after Covid and integrated with RoomPriceGenie to optimize revenue in early 2024. Rezcontrol and RoomPriceGenie caught up with General Manager Martin Buchanan to discover the difference these new technologies have made… ## Background The Oak Tree Inn opened its doors in 1997 and has been improving and expanding its offering to guests ever since, now including pods, cottages, and even a private dining bus! They run an adjoining ice cream parlor and coffee shop, have won the accolade of Scotland’s best pub, and cater for meetings, events, holidaymakers, and touring groups. The hotelprioritizes sustainability in its decision-making and has 246 solar panels that power much of the site, including its EV charging points. They had previously carried out many management tasks by hand, updating reservation details and adjusting rates manually, and struggled to maintain consistency and visibility. As the business grew, with their offering being extended and their popularity reaching far and wide – alongside rapidly developing hospitality technologies – they realized the benefits they would gain from moving to the cloud and investing in a new tech stack for reasons of both revenue and efficiency. ## Martin Buchanan ## The Challenges \"We are a small team and really saw the benefits of streamlining and automating our processes, as well as our internal communication and reporting.\" As a family business in a hotel that enjoys maximum occupancy at peak times, it was challenging to keep on top of all the tasks that needed doing, especially in the summer months. \"We're always full in summer, and there was just too much to do and too little time,\" said Martin. “We knew if we could streamline our processes, it would free up staff time and make everything more professional. We were also generating our own estimates when it came to pricing, and while we know our parameters and what the market will take, especially for our loyal repeat customers, we also knew that with more science behind it, we could generate more bookings in low periods, and more revenue in peak times.\" > \"\"We had little visibility into data and performance metrics and knew this was an obvious area for improvement.\"\" \"We had little visibility into data and performance metrics and knew this was an obvious area for improvement.\" As with any hotel that gets especially busy at certain times, The Oak Tree Inn also needed a system that was easy to use and easy for seasonal staff to learn. ## The Solution Martinwears many hats, working as general manager and in charge of guest services, as well as the restaurant and bar. This extensive role naturally brings him into revenue management, strategy, optimizing efficiency, guest experience, and profitability - which put him in an ideal place to review the technologies available during the compulsory closures of the pandemic and to bring the Oak Tree Inn fully up to date when the hotel was able to reopen. \"We had worked with Hotel Executive for many years,\" he explained, \"so it was a natural choice to consider Rezcontrol.\" He could see the benefits of having everything in one place, updating automatically, with no need to refer to different reports to get the full picture or check reservations and make manual amendments. \"The same applied to the decision to bring RoomPriceGenie on board, which we did in early 2024,\" he said. \"Working manually with OTAs and trying to adjust rates - and they always want to promote the lowest rate - was challenging. You'd see one aspect of general management or occupancy and availability in one place, then room rates in another, and correlating them was tricky, as well as not leading to optimized pricing.\" ## Adapting to the new tech stack “Onboarding for both systems was really smooth – the support is amazing and both platforms have saved countless hours of staff time.“ Change is always worrying, but for The Oak Tree Inn, migrating to Rezcontrol was seamless. This was made easier by having previously run Hotel Executive, which also gave the hotel confidence in the system. Rezcontrol imported all existing reservations and provided excellent onboarding and step-by-step training. “Rezcontrol’s customer service is the best I’ve ever experienced,” said Martin. “I’ve worked with a few systems, and this really stands out to both myself and the team.” Once the RoomPriceGenie algorithm was fine-tuned to align with Martin’s pricing strategy, he gained the confidence to step back from daily rate and revenue monitoring. With the system clearly delivering results—driving both revenue and bookings—he could focus on other aspects of the business, knowing pricing was in good hands with Genie. “I hardly ever get to sit at my desk in summer,” he said, “and I can see it all at a glance on Rezcontrol anyway. The new systems have saved me countless hours.” ## The Benefits \"Rezcontrol and RoomPriceGenie have dramatically improved both efficiency and revenue - and the way the data feeds from one into the other is seamless.” Rezcontrol and RoomPriceGenie's combined solutions have dramatically improved efficiency and also rate-setting. In terms of the PMS, Martin praises Rezcontrol's overall ease of use and the planner in particular. > \"\"With Rezcontrol, you can see everything at a glance, from rates and availability to payments and packages.\"\" \"With Rezcontrol, you can see everything at a glance, from rates and availability to payments and packages.\" \"It's great,\" he said. “You can see everything at a glance, from rates and availability to payment status, linked table bookings - we use Resdiary - and packages. As we've expanded, this has become increasingly important. The automated guest engagement emails save time, look professional and ensure all the details are correct. We also often use them to drive repeat business with bring-back emails and offers.\" > \"\"Stress levels have reduced and the automation of data flow between systems means far easier communication between departments.”\" \"Stress levels have reduced and the automation of data flow between systems means far easier communication between departments.” The team also finds it especially useful to color-customize the planner and that the system is so easy to use for receptionists and management, from changing reservations to pulling reports for housekeeping, occupancy rates, revenue, or anything else. \"We are so busy in summer,\" Martin explained. \"New staff need to be able to pick it up and run with it, and they always do. Stress levels have reduced and the automation of data flow between systems means far easier communication between departments, such as from the front desk to housekeeping and F+B, with clearer, more accessible information.\" ## The Results ## Optimized dynamic pricing strategies to maximize room revenue and direct bookings Regarding pricing strategy, RoomPriceGenie has enabled Oak Tree Inn to move from fixed rates to dynamic ones. \"We realized we were losing out with our fixed rates,\" said Martin, \"but we didn't have all the information or analysis needed to set up dynamic ones. With our location, we are a very seasonal business, and we wanted to be able to set rates based on different days of the week, as well as times of the year; to fill gaps when we had them and maximize rates when demand is highest as well as encouraging direct bookings - without going beyond what guests are willing or able to pay. > \"\"Having spent time working with RoomPriceGenie to set up the algorithm, I now hardly ever need to look at it.\"\" \"Having spent time working with RoomPriceGenie to set up the algorithm, I now hardly ever need to look at it.\" Martin invested more time upfront working with RoomPriceGenie to fine-tune the algorithm, so now it is in place where he hardly ever needs to look at it. \"We can take on board the data-driven rate decisions while allowing manual overrides,\" he explains, \"and we have been able to tailor changes to avoid alienating our core guest base.\" ## 8% higher occupancy and 10% increase in revenue So, can The Oak Tree Inn see quantifiable results from the implementation of Rezcontrol and RoomPriceGenie? \"The return on investment in RoomPriceGenie is clear,\" said Martin. \"We've increased our occupancy rates by 8% in the slower periods, while revenue has increased by 10% overall without this leading to any fall-off in bookings. \"From Rezcontrol, we've seen hugely increased efficiencies and time-savings, enabling us to focus more on our guests and less on admin - which also creates cost saving.\" ## About Rezcontrol Rezcontrolis a fully cloud-based hotel management software which puts hoteliers in control. Available anytime, anywhere, from any device, it enables hotel groups and independent hotels, as well as boutique pubs and inns with rooms, to reach more guests, scale operations and simplify overall hotel management. With a 30-year track record in hotel management software, we know the issues you face, and what you need to run your operation smoothly, efficiently and profitably ## See other Case Studies... ## Raincity Property Group ## The Boathouse Apartments ## Kipara Tropical Rainforest Retreat / BelgraviaPro",
  "category": "case_studies",
  "chunks": [
    "## The Oak Tree Inn - Scotland - 26 to 50 rooms - Rezcontrol The Oak Tree Innis a charming, family-run hotel with 42 bedrooms on the banks of Loch Lomond in the picturesque village of Balmaha. They upgraded from Avondata’s previous server-based PMS, Hotel Executive, to move to the cloud with Rezcontrol just after Covid and integrated with RoomPriceGenie to optimize revenue in early 2024. Rezcontrol and RoomPriceGenie caught up with General Manager Martin Buchanan to discover the difference these new technologies have made… ## Background The Oak Tree Inn opened its doors in 1997 and has been improving and expanding its offering to guests ever since, now including pods, cottages, and even a private dining bus! They run an adjoining ice cream parlor and coffee shop, have won the accolade of Scotland’s best pub, and cater for meetings, events, holidaymakers, and touring groups. The hotelprioritizes sustainability in its decision-making and has 246 solar panels that power much of the site, including its EV charging points. They had previously carried out many management tasks by hand, updating reservation details and adjusting rates manually, and struggled to maintain consistency and visibility. As the business grew, with their offering being extended and their popularity reaching far and wide – alongside rapidly developing hospitality technologies – they realized the benefits they would gain from moving to the cloud and investing in a new tech stack for reasons of both revenue and efficiency. ## Martin Buchanan ## The Challenges \"We are a small team and really saw the benefits of streamlining and automating our processes, as well as our internal communication and reporting.\" As a family business in a hotel that enjoys maximum occupancy at peak times, it was challenging to keep on top of all the tasks that needed doing, especially in the summer months. \"We're always full in summer, and there was just too much to do and too little time,\" said Martin. “We knew if we could streamline our processes, it would free up staff time and make everything more professional. We were also generating our own estimates when it came to pricing, and while we know our parameters and what the market will take, especially for our loyal repeat customers, we also knew that with more science behind it, we could generate more bookings in low periods, and more revenue in peak times.\" > \"\"We had little visibility into data and performance metrics and knew this was an obvious area for improvement.\"\" \"We had little visibility into data and performance metrics and knew this was an obvious area for improvement.\" As with any hotel that gets especially busy at certain times, The Oak Tree Inn also needed a system that was easy to use and easy for seasonal staff to learn. ## The Solution Martinwears many hats, working as general manager and in charge of guest services, as well as the restaurant and bar. This extensive role naturally brings him into revenue management, strategy, optimizing efficiency, guest experience, and",
    "that was easy to use and easy for seasonal staff to learn. ## The Solution Martinwears many hats, working as general manager and in charge of guest services, as well as the restaurant and bar. This extensive role naturally brings him into revenue management, strategy, optimizing efficiency, guest experience, and profitability - which put him in an ideal place to review the technologies available during the compulsory closures of the pandemic and to bring the Oak Tree Inn fully up to date when the hotel was able to reopen. \"We had worked with Hotel Executive for many years,\" he explained, \"so it was a natural choice to consider Rezcontrol.\" He could see the benefits of having everything in one place, updating automatically, with no need to refer to different reports to get the full picture or check reservations and make manual amendments. \"The same applied to the decision to bring RoomPriceGenie on board, which we did in early 2024,\" he said. \"Working manually with OTAs and trying to adjust rates - and they always want to promote the lowest rate - was challenging. You'd see one aspect of general management or occupancy and availability in one place, then room rates in another, and correlating them was tricky, as well as not leading to optimized pricing.\" ## Adapting to the new tech stack “Onboarding for both systems was really smooth – the support is amazing and both platforms have saved countless hours of staff time.“ Change is always worrying, but for The Oak Tree Inn, migrating to Rezcontrol was seamless. This was made easier by having previously run Hotel Executive, which also gave the hotel confidence in the system. Rezcontrol imported all existing reservations and provided excellent onboarding and step-by-step training. “Rezcontrol’s customer service is the best I’ve ever experienced,” said Martin. “I’ve worked with a few systems, and this really stands out to both myself and the team.” Once the RoomPriceGenie algorithm was fine-tuned to align with Martin’s pricing strategy, he gained the confidence to step back from daily rate and revenue monitoring. With the system clearly delivering results—driving both revenue and bookings—he could focus on other aspects of the business, knowing pricing was in good hands with Genie. “I hardly ever get to sit at my desk in summer,” he said, “and I can see it all at a glance on Rezcontrol anyway. The new systems have saved me countless hours.” ## The Benefits \"Rezcontrol and RoomPriceGenie have dramatically improved both efficiency and revenue - and the way the data feeds from one into the other is seamless.” Rezcontrol and RoomPriceGenie's combined solutions have dramatically improved efficiency and also rate-setting. In terms of the PMS, Martin praises Rezcontrol's overall ease of use and the planner in particular. > \"\"With Rezcontrol, you can see everything at a glance, from rates and availability to payments and packages.\"\" \"With Rezcontrol, you can see everything at a glance, from rates and availability to payments and packages.\" \"It's great,\" he said. “You can see",
    "ease of use and the planner in particular. > \"\"With Rezcontrol, you can see everything at a glance, from rates and availability to payments and packages.\"\" \"With Rezcontrol, you can see everything at a glance, from rates and availability to payments and packages.\" \"It's great,\" he said. “You can see everything at a glance, from rates and availability to payment status, linked table bookings - we use Resdiary - and packages. As we've expanded, this has become increasingly important. The automated guest engagement emails save time, look professional and ensure all the details are correct. We also often use them to drive repeat business with bring-back emails and offers.\" > \"\"Stress levels have reduced and the automation of data flow between systems means far easier communication between departments.”\" \"Stress levels have reduced and the automation of data flow between systems means far easier communication between departments.” The team also finds it especially useful to color-customize the planner and that the system is so easy to use for receptionists and management, from changing reservations to pulling reports for housekeeping, occupancy rates, revenue, or anything else. \"We are so busy in summer,\" Martin explained. \"New staff need to be able to pick it up and run with it, and they always do. Stress levels have reduced and the automation of data flow between systems means far easier communication between departments, such as from the front desk to housekeeping and F+B, with clearer, more accessible information.\" ## The Results ## Optimized dynamic pricing strategies to maximize room revenue and direct bookings Regarding pricing strategy, RoomPriceGenie has enabled Oak Tree Inn to move from fixed rates to dynamic ones. \"We realized we were losing out with our fixed rates,\" said Martin, \"but we didn't have all the information or analysis needed to set up dynamic ones. With our location, we are a very seasonal business, and we wanted to be able to set rates based on different days of the week, as well as times of the year; to fill gaps when we had them and maximize rates when demand is highest as well as encouraging direct bookings - without going beyond what guests are willing or able to pay. > \"\"Having spent time working with RoomPriceGenie to set up the algorithm, I now hardly ever need to look at it.\"\" \"Having spent time working with RoomPriceGenie to set up the algorithm, I now hardly ever need to look at it.\" Martin invested more time upfront working with RoomPriceGenie to fine-tune the algorithm, so now it is in place where he hardly ever needs to look at it. \"We can take on board the data-driven rate decisions while allowing manual overrides,\" he explains, \"and we have been able to tailor changes to avoid alienating our core guest base.\" ## 8% higher occupancy and 10% increase in revenue So, can The Oak Tree Inn see quantifiable results from the implementation of Rezcontrol and RoomPriceGenie? \"The return on investment in RoomPriceGenie is clear,\" said Martin. \"We've",
    "we have been able to tailor changes to avoid alienating our core guest base.\" ## 8% higher occupancy and 10% increase in revenue So, can The Oak Tree Inn see quantifiable results from the implementation of Rezcontrol and RoomPriceGenie? \"The return on investment in RoomPriceGenie is clear,\" said Martin. \"We've increased our occupancy rates by 8% in the slower periods, while revenue has increased by 10% overall without this leading to any fall-off in bookings. \"From Rezcontrol, we've seen hugely increased efficiencies and time-savings, enabling us to focus more on our guests and less on admin - which also creates cost saving.\" ## About Rezcontrol Rezcontrolis a fully cloud-based hotel management software which puts hoteliers in control. Available anytime, anywhere, from any device, it enables hotel groups and independent hotels, as well as boutique pubs and inns with rooms, to reach more guests, scale operations and simplify overall hotel management. With a 30-year track record in hotel management software, we know the issues you face, and what you need to run your operation smoothly, efficiently and profitably ## See other Case Studies... ## Raincity Property Group ## The Boathouse Apartments ## Kipara Tropical Rainforest Retreat / BelgraviaPro"
  ]
}